In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b' ,'c']
mydata = [10,20,30]

In [3]:
s1 = pd.Series(data=mydata,index=labels)

In [4]:
s1 #single column

a    10
b    20
c    30
dtype: int64

In [5]:
type(s1)

pandas.core.series.Series

In [6]:
s1.size

3

In [7]:
s1.shape

(3,)

In [8]:
s1.ndim

1

In [9]:
s1 = pd.Series(data=mydata)

In [10]:
s1

0    10
1    20
2    30
dtype: int64

In [11]:
s2 =  s1 #shallow copy

In [12]:
s2+s1

0    20
1    40
2    60
dtype: int64

In [13]:
id(s1)

1690219154304

In [14]:
id(s2)

1690219154304

# Dataframes

In [15]:
df1 = pd.read_csv(r"sample1.csv")  
# df1 = pd.read_csv(r"sample1.csv",header=None) #if 1st row is data

In [16]:
df1

    a   b   c   d   e   f
0  82  94  83  44  59  49
1  68  42  76  92  95  74
2  50  50  73  16  80  71
3  90  31  36  26  34  56
4  82  83  50  97  45  35
5  49  99  94  99  80  60

In [41]:
df1 = pd.read_csv(r"sample1.csv",header=None) #if 1st row is data

In [42]:
df1

    0   1   2   3   4   5
0   a   b   c   d   e   f
1  82  94  83  44  59  49
2  68  42  76  92  95  74
3  50  50  73  16  80  71
4  90  31  36  26  34  56
5  82  83  50  97  45  35
6  49  99  94  99  80  60

In [17]:
from numpy.random import randn

In [18]:
df1.shape

(6, 6)

In [19]:
randn(6,6)

array([[-2.19514883e+00,  1.04285368e+00, -4.71128145e-01,
        -1.53415989e+00, -8.10438528e-01, -5.99538778e-01],
       [ 8.35188352e-01, -1.13132306e+00, -7.13514928e-01,
        -8.05838825e-01, -4.99252340e-04,  8.81975171e-01],
       [-7.40487984e-01, -5.54091986e-01, -1.33478647e+00,
        -5.57532903e-01, -2.89350764e+00,  6.34085227e-01],
       [-6.30464041e-01, -2.19517410e-02,  5.89327741e-01,
         7.03066117e-03,  5.05060203e-01, -6.31464296e-02],
       [ 2.53403118e-01, -1.38072038e-01, -2.04228766e+00,
        -4.91542739e-01, -1.53304805e+00,  1.47878798e+00],
       [-8.30591083e-02,  1.04325237e+00, -1.84688148e+00,
        -1.20075513e+00,  6.92771190e-01,  9.43787682e-01]])

In [20]:
df2 = pd.DataFrame(randn(6,6),['A', 'B', 'C', 'D' ,'E', 'F'],['U', 'V', 'W' ,'X' ,'Y', 'Z'])

In [21]:
df2

          U         V         W         X         Y         Z
A -0.759737  0.266710  0.007235  0.910415  1.140592  0.147112
B  0.222767 -0.748158  1.452103  0.520241  1.206189  0.236750
C  0.872751  0.061439 -0.802892 -1.137246  1.210175  0.020209
D -2.008223  0.134454  1.121393 -1.208746  1.212833  0.619214
E -1.023908  0.600082  0.818949  1.271522  0.566466  2.339396
F  0.680939 -1.277120 -1.531409 -0.040804  2.213050  1.259100

In [22]:
np.random.seed(101) # to generate number with formula at 101
df2 = pd.DataFrame(randn(6,6),list("A B C D E F".split(" ")) ,list("U V W X Y Z".split(" ") ))

In [23]:
df2

          U         V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960
F  0.638787  0.329646 -0.497104 -0.754070 -0.943406  0.484752

In [24]:
df2

          U         V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960
F  0.638787  0.329646 -0.497104 -0.754070 -0.943406  0.484752

In [25]:
df2.ndim

2

In [26]:
df2.size

36

In [27]:
df2.shape

(6, 6)

In [28]:
type(df2) # collection of serieas is a  DF

pandas.core.frame.DataFrame

# L65 Accessing DF

In [40]:
df2

          U         V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960
F  0.638787  0.329646 -0.497104 -0.754070 -0.943406  0.484752

In [47]:
# Accessing columns 
#  using dot
#  not recommended
df2.X

A    0.503826
B    0.740122
C    0.955057
D    1.693723
E    0.184502
F   -0.754070
Name: X, dtype: float64

In [49]:
#  [] for accessing the data
df2['Z']

A   -0.319318
B   -0.589001
C    1.978757
D   -1.159119
E    0.072960
F    0.484752
Name: Z, dtype: float64

In [51]:
#  [] for accessing multiple columns
df2[['X','Z']]

          X         Z
A  0.503826 -0.319318
B  0.740122 -0.589001
C  0.955057  1.978757
D  1.693723 -1.159119
E  0.184502  0.072960
F -0.754070  0.484752

In [53]:
# U and V
df2[['U','V']]

          U         V
A  2.706850  0.628133
B -0.848077  0.605965
C  0.188695 -0.758872
D  2.605967  0.683509
E -0.134841  0.390528
F  0.638787  0.329646

In [54]:
df2[["V","Y"]]

          V         Y
A  0.628133  0.651118
B  0.605965  0.528813
C -0.758872  0.190794
D  0.683509 -1.706086
E  0.390528  0.807706
F  0.329646 -0.943406

In [55]:
# Adding a new column
df2["Z2"] = df2["Z"]*2

In [56]:
df2

          U         V         W         X         Y         Z        Z2
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318 -0.638636
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001 -1.178001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757  3.957515
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119 -2.318239
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960  0.145919
F  0.638787  0.329646 -0.497104 -0.754070 -0.943406  0.484752  0.969503

In [61]:
# deleting a column 
# inplace=True for permanent deletion
df2.drop('X',axis=1,inplace=True)

In [62]:
df2

          U         V         W         Y         Z        Z2
A  2.706850  0.628133  0.907969  0.651118 -0.319318 -0.638636
B -0.848077  0.605965 -2.018168  0.528813 -0.589001 -1.178001
C  0.188695 -0.758872 -0.933237  0.190794  1.978757  3.957515
D  2.605967  0.683509  0.302665 -1.706086 -1.159119 -2.318239
E -0.134841  0.390528  0.166905  0.807706  0.072960  0.145919
F  0.638787  0.329646 -0.497104 -0.943406  0.484752  0.969503

In [63]:
df2

          U         V         W         Y         Z        Z2
A  2.706850  0.628133  0.907969  0.651118 -0.319318 -0.638636
B -0.848077  0.605965 -2.018168  0.528813 -0.589001 -1.178001
C  0.188695 -0.758872 -0.933237  0.190794  1.978757  3.957515
D  2.605967  0.683509  0.302665 -1.706086 -1.159119 -2.318239
E -0.134841  0.390528  0.166905  0.807706  0.072960  0.145919
F  0.638787  0.329646 -0.497104 -0.943406  0.484752  0.969503

In [64]:
df2[["U","Y","Z2"]]

          U         Y        Z2
A  2.706850  0.651118 -0.638636
B -0.848077  0.528813 -1.178001
C  0.188695  0.190794  3.957515
D  2.605967 -1.706086 -2.318239
E -0.134841  0.807706  0.145919
F  0.638787 -0.943406  0.969503

In [74]:
# Accessing rows
df2.loc[['A','B',"D"]]

          U         V         W         Y         Z        Z2
A  2.706850  0.628133  0.907969  0.651118 -0.319318 -0.638636
B -0.848077  0.605965 -2.018168  0.528813 -0.589001 -1.178001
D  2.605967  0.683509  0.302665 -1.706086 -1.159119 -2.318239

In [73]:
df2.loc["A"]

U     2.706850
V     0.628133
W     0.907969
Y     0.651118
Z    -0.319318
Z2   -0.638636
Name: A, dtype: float64

In [79]:
# accessing A row via indexing
df2.iloc[0:2]

          U         V         W         Y         Z        Z2
A  2.706850  0.628133  0.907969  0.651118 -0.319318 -0.638636
B -0.848077  0.605965 -2.018168  0.528813 -0.589001 -1.178001

In [80]:
df2.iloc[0:2]["Z"]

A   -0.319318
B   -0.589001
Name: Z, dtype: float64

In [84]:
#  Reading part of the table

In [82]:
df2.iloc[0:2][["Y","Z"]]

          Y         Z
A  0.651118 -0.319318
B  0.528813 -0.589001

In [83]:
df2.iloc[0:2][["U","Z"]]

          U         Z
A  2.706850 -0.319318
B -0.848077 -0.589001

In [86]:
df2.iloc[1:2][["Z"]]

          Z
B -0.589001

# L66 Conditional Selection

In [88]:
np.random.seed(101) # to generate number with formula at 101
df2 = pd.DataFrame(randn(6,6),list("A B C D E F".split(" ")) ,list("U V W X Y Z".split(" ") ))

In [ ]:
# df2[df2.loc[["A","B"]]>0][["Y","Z"]]

In [170]:
import numpy as np
import pandas as pd

In [155]:
pd.read_csv(r"C:\Users\RAHUL\Documents\OnePython\5. Sept DS 9AM 4PM\CLASS\sample2.csv")

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [161]:
df3 = pd.read_csv('sample2.csv')

In [162]:
df3

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [163]:
# finding columns greater than 80
df3>80

       a      b      c      d      e      f
0  False  False  False  False  False  False
1  False  False   True  False  False  False
2  False  False  False   True  False   True
3  False  False  False   True   True  False
4  False   True   True   True  False  False

In [164]:
df3[df3>80]

    a     b     c     d     e     f
0 NaN   NaN   NaN   NaN   NaN   NaN
1 NaN   NaN  84.0   NaN   NaN   NaN
2 NaN   NaN   NaN  92.0   NaN  99.0
3 NaN   NaN   NaN  87.0  90.0   NaN
4 NaN  97.0  92.0  90.0   NaN   NaN

In [165]:
df3[df3>80]["b"]

0     NaN
1     NaN
2     NaN
3     NaN
4    97.0
Name: b, dtype: float64

In [167]:
df3[df3>80][["b","e"]]

      b     e
0   NaN   NaN
1   NaN   NaN
2   NaN   NaN
3   NaN  90.0
4  97.0   NaN

In [169]:
# finding columns greater than 40 in e and f column

In [171]:
#  1. reading the file and saving in a variable
import numpy as np
import pandas as pd

In [173]:
df4 = pd.read_csv(r"C:\Users\RAHUL\Documents\OnePython\5. Sept DS 9AM 4PM\CLASS\sample2.csv")

In [174]:
df4

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [175]:
# 2. boolean > 40

In [176]:
df4 > 40

      a     b     c     d     e     f
0  True  True  True  True  True  True
1  True  True  True  True  True  True
2  True  True  True  True  True  True
3  True  True  True  True  True  True
4  True  True  True  True  True  True

In [177]:
# 3. getting the values of each boolean

In [178]:
df4[df4 > 40] # based on numpy, elementwise operation

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [179]:
# applying condition for columns

In [185]:
df4[df4 > 40][["e","f","a"]]

    e   f   a
0  51  68  80
1  67  52  70
2  70  99  64
3  90  65  58
4  70  54  55

In [186]:
# applying multiple condition

In [192]:
df4['a']>70

0     True
1    False
2    False
3    False
4    False
Name: a, dtype: bool

In [194]:
df4[df4['a']>70]["a"]

0    80
Name: a, dtype: int64

In [199]:
# using AND 
df4[(df4['a']>70) &  (df4['b']>60)]

    a   b   c   d   e   f
0  80  70  68  53  51  68

In [200]:
df4

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [201]:
df4[(df4['a']>63) &  (df4['b']>60)]

    a   b   c   d   e   f
0  80  70  68  53  51  68
2  64  63  68  92  70  99

In [202]:
#  OR using |
df4[(df4['a']>63) |  (df4['b']>60)]

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
4  55  97  92  90  70  54

In [206]:
# filtering out only required columns
df4[(df4['a']>63) |  (df4['b']>60)][["a","b"]]

    a   b
0  80  70
1  70  42
2  64  63
4  55  97

In [212]:
df4[::-1]

    a   b   c   d   e   f
4  55  97  92  90  70  54
3  58  49  68  87  90  65
2  64  63  68  92  70  99
1  70  42  84  78  67  52
0  80  70  68  53  51  68

In [224]:
df4

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [232]:
df4.loc[4,"f"]

54

In [233]:
df4[(df4['a']>63) |  (df4['b']>60)][["a","b"]]

    a   b
0  80  70
1  70  42
2  64  63
4  55  97

In [236]:
df4.loc([(df4['a']>63)

SyntaxError: incomplete input (1139859935.py, line 1)

In [278]:
df4.where(df4['a']>63)

      a     b     c     d     e     f
0  80.0  70.0  68.0  53.0  51.0  68.0
1  70.0  42.0  84.0  78.0  67.0  52.0
2  64.0  63.0  68.0  92.0  70.0  99.0
3   NaN   NaN   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN   NaN   NaN

#  L 67 Missing data and Groupby

In [312]:
import numpy as np
import pandas as pd

In [313]:
df4

    a   b   c   d   e   f
0  80  70  68  53  51  68
1  70  42  84  78  67  52
2  64  63  68  92  70  99
3  58  49  68  87  90  65
4  55  97  92  90  70  54

In [320]:
df4.loc[0:0,'f':'f'] # df.loc[row,colum] , includes the last index

    f
0  68

In [321]:
#  missing data

In [343]:
df5 = pd.read_csv('samplemiss.csv')

In [325]:
df5 #NaN , nan means NOt A number

      a     b     c     d     e   f
0  74.0  39.0  12.0  13.0  14.0  90
1  25.0  58.0  12.0  99.0  74.0  79
2  33.0  87.0  36.0   NaN   NaN  33
3  68.0   NaN   NaN  42.0  39.0  76
4   NaN  58.0  74.0  87.0  12.0  24

In [329]:
# df5.dropna(axis=0)
df5.dropna() # default axis is 0 , ie will check NaN in rows

      a     b     c     d     e   f
0  74.0  39.0  12.0  13.0  14.0  90
1  25.0  58.0  12.0  99.0  74.0  79

In [328]:
df5.dropna(axis=1)

    f
0  90
1  79
2  33
3  76
4  24

In [331]:
df5.dropna(thresh=5) # we should have a min 5 values

      a     b     c     d     e   f
0  74.0  39.0  12.0  13.0  14.0  90
1  25.0  58.0  12.0  99.0  74.0  79
4   NaN  58.0  74.0  87.0  12.0  24

In [332]:
df5.dropna(thresh=6)

      a     b     c     d     e   f
0  74.0  39.0  12.0  13.0  14.0  90
1  25.0  58.0  12.0  99.0  74.0  79

In [333]:
df5.dropna(thresh=4)

      a     b     c     d     e   f
0  74.0  39.0  12.0  13.0  14.0  90
1  25.0  58.0  12.0  99.0  74.0  79
2  33.0  87.0  36.0   NaN   NaN  33
3  68.0   NaN   NaN  42.0  39.0  76
4   NaN  58.0  74.0  87.0  12.0  24

In [334]:
df5.fillna(value="SOME DATA")

           a          b          c          d          e   f
0       74.0       39.0       12.0       13.0       14.0  90
1       25.0       58.0       12.0       99.0       74.0  79
2       33.0       87.0       36.0  SOME DATA  SOME DATA  33
3       68.0  SOME DATA  SOME DATA       42.0       39.0  76
4  SOME DATA       58.0       74.0       87.0       12.0  24

In [344]:
df5['a'].fillna(value=df5['a'].mean())

0    74.0
1    25.0
2    33.0
3    68.0
4    50.0
Name: a, dtype: float64

In [339]:
df5

0    74.0
1    25.0
2    33.0
3    68.0
4    50.0
Name: a, dtype: float64

In [345]:
type(df5)

pandas.core.frame.DataFrame

In [346]:
df5.fillna(value=999)

       a      b      c      d      e   f
0   74.0   39.0   12.0   13.0   14.0  90
1   25.0   58.0   12.0   99.0   74.0  79
2   33.0   87.0   36.0  999.0  999.0  33
3   68.0  999.0  999.0   42.0   39.0  76
4  999.0   58.0   74.0   87.0   12.0  24

# Groupby

In [347]:
import numpy as np
import pandas as pd

In [348]:
df6 = pd.read_csv('samplegroup.csv')

In [349]:
df6

    company person  sales
0    amazon      a    255
1    amazon      b    341
2    amazon      c    353
3    google      d    204
4    google      e    421
5  flipkart      f    261
6  flipkart      g    503
7  flipkart      h    302
8     apple      i    621

In [351]:
df6.groupby('company').sum()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_17984\2793897186.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df6.groupby('company').sum()

          sales
company
amazon      949
apple       621
flipkart   1066
google      625

In [352]:
df6.groupby('company').mean()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_17984\1988143731.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df6.groupby('company').mean()

               sales
company
amazon    316.333333
apple     621.000000
flipkart  355.333333
google    312.500000

In [353]:
df6.groupby('company').mean().loc['flipkart']

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_17984\514805152.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df6.groupby('company').mean().loc['flipkart']

sales    355.333333
Name: flipkart, dtype: float64

In [354]:
df6.groupby('company').sum().loc['flipkart']

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_17984\1751734508.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df6.groupby('company').sum().loc['flipkart']

sales    1066
Name: flipkart, dtype: int64

In [355]:
df6.groupby('company').min()

         person  sales
company
amazon        a    255
apple         i    621
flipkart      f    261
google        d    204

In [356]:
df6.groupby('company').max()

         person  sales
company
amazon        c    353
apple         i    621
flipkart      h    503
google        e    421

#  L68 Merge, join, concatenate

In [437]:
# https://pandas.pydata.org/docs/user_guide/merging.html#
# https://realpython.com/pandas-merge-join-and-concat/#:~:text=merge()%20for%20combining%20data,DataFrames%20across%20rows%20or%20columns

In [385]:
#  REVISION

In [386]:
df5= pd.read_csv('samplegroup.csv')

In [387]:
df5

    company person  sales  products
0    amazon      a    255        23
1    amazon      b    341        23
2    amazon      c    353        23
3    google      d    204        44
4    google      e    421        55
5  flipkart      f    261       500
6  flipkart      g    503       123
7  flipkart      h    302        56
8     apple      i    621        56

In [389]:
df5.groupby('company').sum()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_17984\2051173188.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df5.groupby('company').sum()

          sales  products
company
amazon      949        69
apple       621        56
flipkart   1066       679
google      625        99

In [390]:
df5.groupby('company').min()

         person  sales  products
company
amazon        a    255        23
apple         i    621        56
flipkart      f    261        56
google        d    204        44

In [391]:
df5.groupby('company').max()

         person  sales  products
company
amazon        c    353        23
apple         i    621        56
flipkart      h    503       500
google        e    421        55

In [392]:
df5.groupby('company').mean()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_17984\4074898674.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df5.groupby('company').mean()

               sales    products
company
amazon    316.333333   23.000000
apple     621.000000   56.000000
flipkart  355.333333  226.333333
google    312.500000   49.500000

In [393]:
#  Concatenation

In [394]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [395]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [396]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [397]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [400]:
pd.concat([df1,df2,df3],axis=0) # default is axis=0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [401]:
pd.concat([df1,df2,df3],axis=1) # changing default is axis=0 to 1

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [403]:
pd.concat([df1,df2],axis=0)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [404]:
pd.concat([df2,df1],axis=0)

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [402]:
#  Merging

In [405]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

In [406]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [407]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [410]:
pd.merge(left,right, how='inner') # default how='inner'

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [409]:
pd.merge(left,right,how='outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [412]:
left = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


right = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)


# result = pd.merge(left, right, on=["key1", "key2"])

In [413]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [414]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [417]:
pd.merge(left,right,how='inner')

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [416]:
pd.merge(left,right,how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [418]:
# Joining

In [430]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)


right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)


result = left.join(right)

In [431]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [432]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [433]:
left.join(right,how='outer') # join is a method of the instance, while , merge and concat are modules

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [435]:
right.join(left) # priority right

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [436]:
left.join(right,how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

# L69 Operations

In [438]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [441]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
#  finding unique entries

In [446]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [447]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','abc','ghi','xyz']})

In [448]:
df['col3'].unique()

array(['abc', 'ghi', 'xyz'], dtype=object)

In [449]:
len(df['col3'].unique())

3

In [450]:
df['col3'].nunique() # finding number of unique values

3

In [451]:
# findin the frequency or number of repetition

In [452]:
df['col3'].value_counts()

abc    2
ghi    1
xyz    1
Name: col3, dtype: int64

In [ ]:
# apply method for customised function

In [453]:
df['col2'].sum()

2109

In [454]:
df['col1'].sum()

10

In [455]:
df['col3'].sum() #concatenate

'abcabcghixyz'

In [456]:
def double(x):
    return 2*x

double(50)

100

In [457]:
df['col2'].apply(double)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [458]:
df['col2'].apply(lambda x : 2*x) # doubling the elements in a column

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [459]:
df['col2'].apply(lambda x : x*x) # squaring  the elements in a column

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [ ]:
# sorting the data in a column

In [460]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  abc
2     3   666  ghi

In [461]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  abc
2     3   666  ghi
3     4   444  xyz

In [469]:
df =  pd.read_csv('nullval.csv')

In [470]:
df

   col1 col2  col3
0     1   aa   222
1     2   ss   333
2     3   dd   444
3     4  NaN   555

In [471]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True  False

In [473]:
df[df.isnull()] # ???

   col1 col2  col3
0   NaN  NaN   NaN
1   NaN  NaN   NaN
2   NaN  NaN   NaN
3   NaN  NaN   NaN

In [440]:
# Piviot table

In [474]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [ ]:
df = pd.DataFrame